benchmark/go-frameworks/results/20260924-102750/results/post/fasthttp/r3/80000.txt
Running 40s test @ http://10.128.0.4:8086/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.037ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.024ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.043ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04ms  523.92us  13.82ms   71.77%
    Req/Sec     5.28k   511.15    10.22k    84.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.36ms
 90.000%    1.64ms
 99.000%    2.30ms
 99.900%    5.20ms
 99.990%    8.55ms
 99.999%   10.68ms
100.000%   13.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.088     0.000000            1         1.00
       0.424     0.100000       239166         1.11
       0.594     0.200000       478284         1.25
       0.744     0.300000       716174         1.43
       0.881     0.400000       955010         1.67
       1.012     0.500000      1193572         2.00
       1.078     0.550000      1313394         2.22
       1.145     0.600000      1432875         2.50
       1.214     0.650000      1552854         2.86
       1.284     0.700000      1671212         3.33
       1.357     0.750000      1790522         4.00
       1.395     0.775000      1850514         4.44
       1.435     0.800000      1910898         5.00
       1.477     0.825000      1969378         5.71
       1.524     0.850000      2029808         6.67
       1.578     0.875000      2089659         8.00
       1.607     0.887500      2118507         8.89
       1.640     0.900000      2148780        10.00
       1.676     0.912500      2178644        11.43
       1.717     0.925000      2208509        13.33
       1.765     0.937500      2238306        16.00
       1.792     0.943750      2253108        17.78
       1.821     0.950000      2267848        20.00
       1.854     0.956250      2282921        22.86
       1.891     0.962500      2297626        26.67
       1.935     0.968750      2312574        32.00
       1.961     0.971875      2320146        35.56
       1.990     0.975000      2327488        40.00
       2.025     0.978125      2334992        45.71
       2.065     0.981250      2342362        53.33
       2.119     0.984375      2349747        64.00
       2.153     0.985938      2353487        71.11
       2.197     0.987500      2357321        80.00
       2.253     0.989062      2361014        91.43
       2.337     0.990625      2364698       106.67
       2.475     0.992188      2368413       128.00
       2.575     0.992969      2370281       142.22
       2.705     0.993750      2372124       160.00
       2.871     0.994531      2373991       182.86
       3.063     0.995313      2375868       213.33
       3.291     0.996094      2377726       256.00
       3.421     0.996484      2378652       284.44
       3.581     0.996875      2379590       320.00
       3.769     0.997266      2380535       365.71
       3.975     0.997656      2381453       426.67
       4.243     0.998047      2382387       512.00
       4.411     0.998242      2382859       568.89
       4.583     0.998437      2383317       640.00
       4.779     0.998633      2383784       731.43
       4.987     0.998828      2384246       853.33
       5.231     0.999023      2384715      1024.00
       5.391     0.999121      2384952      1137.78
       5.547     0.999219      2385183      1280.00
       5.719     0.999316      2385412      1462.86
       5.935     0.999414      2385645      1706.67
       6.231     0.999512      2385878      2048.00
       6.403     0.999561      2385997      2275.56
       6.599     0.999609      2386112      2560.00
       6.835     0.999658      2386230      2925.71
       7.051     0.999707      2386344      3413.33
       7.367     0.999756      2386464      4096.00
       7.551     0.999780      2386521      4551.11
       7.699     0.999805      2386577      5120.00
       7.855     0.999829      2386639      5851.43
       8.019     0.999854      2386694      6826.67
       8.295     0.999878      2386753      8192.00
       8.447     0.999890      2386782      9102.22
       8.575     0.999902      2386811     10240.00
       8.703     0.999915      2386843     11702.86
       8.871     0.999927      2386870     13653.33
       9.087     0.999939      2386898     16384.00
       9.183     0.999945      2386912     18204.44
       9.311     0.999951      2386927     20480.00
       9.455     0.999957      2386942     23405.71
       9.575     0.999963      2386957     27306.67
       9.687     0.999969      2386971     32768.00
       9.743     0.999973      2386978     36408.89
       9.831     0.999976      2386985     40960.00
       9.927     0.999979      2386994     46811.43
      10.015     0.999982      2387000     54613.33
      10.303     0.999985      2387007     65536.00
      10.543     0.999986      2387012     72817.78
      10.551     0.999988      2387014     81920.00
      10.679     0.999989      2387019     93622.86
      10.895     0.999991      2387022    109226.67
      10.967     0.999992      2387025    131072.00
      11.031     0.999993      2387027    145635.56
      11.103     0.999994      2387029    163840.00
      11.167     0.999995      2387031    187245.71
      11.215     0.999995      2387033    218453.33
      11.295     0.999996      2387034    262144.00
      11.471     0.999997      2387035    291271.11
      11.623     0.999997      2387036    327680.00
      11.735     0.999997      2387037    374491.43
      11.991     0.999998      2387038    436906.67
      12.183     0.999998      2387039    524288.00
      12.183     0.999998      2387039    582542.22
      12.447     0.999998      2387040    655360.00
      12.447     0.999999      2387040    748982.86
      12.495     0.999999      2387041    873813.33
      12.495     0.999999      2387041   1048576.00
      12.495     0.999999      2387041   1165084.44
      12.711     0.999999      2387042   1310720.00
      12.711     0.999999      2387042   1497965.71
      12.711     0.999999      2387042   1747626.67
      12.711     1.000000      2387042   2097152.00
      12.711     1.000000      2387042   2330168.89
      13.823     1.000000      2387043   2621440.00
      13.823     1.000000      2387043          inf
#[Mean    =        1.043, StdDeviation   =        0.524]
#[Max     =       13.816, Total count    =      2387043]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3184542 requests in 40.00s, 580.07MB read
Requests/sec:  79616.81
Transfer/sec:     14.50MB